SpenceKonde/DxCore/megaavr/variants/32pin-ddseries/pins_arduino.h
/*  (C) Spence Konde 2021-2022 open source (LGPL2.1 see LICENSE.md) based on existing Arduino cores.*/
//                                                                                    *INDENT-OFF*
/*
 ###  #     # ####      ####  ####      ###   ##
#   # #     # #   #     #   # #   #        # #  #           #
#####  #   #  ####      #   # #   #      ##    #   ### ###     ###
#   #   # #   #  #      #   # #   #        #  #        #  # #  #  #
#   #    #    #   #     ####  ####      ###  ####      ###  #  #  #
===================================     ----------     #
Variant Definition file for generic DD parts           #
with 32 pins.

Part Numbers
AVR64DD32 AVR32DD32 AVR16DD32

Include guard and include basic libraries. We are normally including this inside Arduino.h */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

#define DD_32PIN_PINOUT

 /*##  ### #   #  ###
 #   #  #  ##  # #
 ####   #  # # #  ###
 #      #  #  ##     #
 #     ### #   #  #*/

/* Like the 28-pin parts, the 32-pin DD's have a layout and
 * numbering scheme identical to the DA/DBm just with more analog pins. */

#define PIN_PA0 (0)
#define PIN_PA1 (1)
#define PIN_PA2 (2)
#define PIN_PA3 (3)
#define PIN_PA4 (4)
#define PIN_PA5 (5)
#define PIN_PA6 (6)
#define PIN_PA7 (7)
#define PIN_PC0 (8)
#define PIN_PC1 (9)
#define PIN_PC2 (10)
#define PIN_PC3 (11)
#define PIN_PD0 (12) // NOT_A_PIN
#define PIN_PD1 (13)
#define PIN_PD2 (14)
#define PIN_PD3 (15)
#define PIN_PD4 (16)
#define PIN_PD5 (17)
#define PIN_PD6 (18)
#define PIN_PD7 (19)
#define PIN_PF0 (20)
#define PIN_PF1 (21)
#define PIN_PF2 (22)
#define PIN_PF3 (23)
#define PIN_PF4 (24)
#define PIN_PF5 (25)
#define PIN_PF6 (26) // RESET
#define PIN_PF7 (27) // UPDI

#define FAKE_PIN_PD0

        /*##   ##   ###  ###  ###  ###
        #   # #  # #      #  #    #
        ####  ####  ###   #  #     ###
        #   # #  #     #  #  #        #
        ####  #  # ####  ###  ###  #*/

#define PINS_COUNT                     28
#define NUM_ANALOG_INPUTS              23
// #define NUM_RESERVED_PINS            0     // These may at your option be defined,
// #define NUM_INTERNALLY_USED_PINS     0     // They will be filled in with defaults otherwise
// Autocalculated are :
// NUM_DIGITAL_PINS = PINS_COUNT - NUM_RESERVED_PINS
// TOTAL_FREE_OPINS = NUM_DIGITAL_PINS - NUM_INTERNALLY_USED_PINS
// Count of I2C and SPI pins will be defined as 2 and 3 but not used in further calculations. If you
// for some reason need to change this, define them here. Only ones not defined here get automatically set.
  #define LED_BUILTIN                  PIN_PA7

/* Until the legacy attach interrupt has been completely obsoleted - this is such a waste here! */
#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS        48
#endif

       /*   #  ###   ### ####   ###   ###
        ## ## #   # #    #   # #   # #
        # # # ##### #    ####  #   #  ###
        #   # #   # #    # #   #   #     #
        #   # #   #  ### #  #   ###   ##*/
// If you change the number of pins in any way or if the part has ADC on different pins from the board you are adapting
// you must ensure that these will do what they say they will do.
// that bit about the 4 ADC ADC channels on PORTC not worling with MVIO enabled is ugly to handle.
#if !defined(USING_OPTIBOOT) || defined(ASSUME_MVIO_FUSE) /* When not using a bootloader, we know if MVIO is enabled because the fuse is set on upload */
  #if defined(MVIO_ENABLED) /* MVIO disables ADC on PORTC */
    #define IS_MVIO_ENABLED()                    (1)
    #define digitalPinToAnalogInput(p)           ((p) >= PIN_PD0 ? (((p) < PIN_PF0)   ? ((p) - PIN_PD0) : ((p) < PIN_PF6)   ? ((p) -  4)      : NOT_A_PIN)  : (((p) > PIN_PA1 && (p) < PIN_PC0)      ? ((p) + 20) : NOT_A_PIN))
    #define analogChannelToDigitalPin(p)         ((p) > 27 ? NOT_A_PIN : ((p) < 8     ? ((p) + PIN_PD0) : ((p) > 21)        ? ((p) - 20)      : ((p) > 15   ? ((p) + 4) : NOT_A_PIN)))
  #else
    #define IS_MVIO_ENABLED()                    (0)
    #define digitalPinToAnalogInput(p)           ((p) >= PIN_PD0 ? (((p) < PIN_PF0)   ? ((p) - PIN_PD0] : (((p) < PIN_PF6)  ? ((p) -  4)      : NOT_A_PIN) : (((p) > PIN_PA1)                        ? ((p) + 20) : NOT_A_PIN))
    #define analogChannelToDigitalPin(p)         ((p) > 31 ? NOT_A_PIN : ((p) < 8     ? ((p) + PIN_PD0) : ((p) > 21)        ? ((p) - 20)      : ((p) > 15)  ? ((p) + 4) : NOT_A_PIN))
  #endif
#else /* If we ARE using a bootloader, we can't be sure if MVIO is enabled :-( */
  #define IS_MVIO_ENABLED() ((FUSE.SYSCFG1 & 0x01) == 0)
  #define digitalPinToAnalogInput(p)             ((p) >= PIN_PD0 ? (((p) < PIN_PF0)   ? ((p) - PIN_PD0) : ((p) < PIN_PF6)  ? ((p) - 4)        : NOT_A_PIN)  : (((p) > PIN_PA1 && !(IS_MVIO_ENABLED() && (p) >= PIN_PC0)) ? ((p) + 20* : NOT_A_PIN))
  #define analogChannelToDigitalPin(p)           ((p) > (IS_MVIO_ENABLED() ? 27 : 31) ?       NOT_A_PIN : ((p) < 8)        ? ((p) + PIN_PD0)  : (((p) > 21) ? ((p) - 20) :  ((p) > 15 ) ? ((p) + 4) : NOT_A_PIN))
#endif

#define analogInputToDigitalPin(p)                        analogChannelToDigitalPin((p) & 0x7F) /*This assumes that the argument is NOT a digital pin number - but allows channel ID's or channel numbers. */
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p)<=NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN)) /* This will act on either kind of pin ID but not analog channel*/


#if defined(_MACRO_PORT_TO_PIN_ZERO)
  #define portToDigitalPinZero(port)        ((port) == 0  ? 0 : ((port)== 2 ? 8 : ((port)== 3 ? 12 : ((port)== 5 ? 20 : NOT_A_PIN))))
#elif defined(_ASM_PORT_TO_PIN_ZERO)
/*
  static uint8_t _portToDigitalPinZero_ASM(uint8_t port);
  uint8_t _portToDigitalPinZero_ASM(uint8_t port) {
    __asm__ __volatile__(
      "cpi       %0,     6"   "\n\t"    // Compare to 5 - if lower then port is valid.            1 clock
      "brcc     .+4       "   "\n\t"    // if port is valid                                       2 clocks if valid 1 if no1
        "_pTDPZ_INV:      "   "\n\t"    // land here when port is 1 or 4 too;
        "ldi     %0    255"   "\n\t"    // otherwise not valid port load result with NOT_A_PIN    1 clock only if invalid
        "rjmp  _pTDPZ_END "   "\n\t"    //jump to end                                             2 clock only if invalid
      //land here if port isn't >5, == 4 or === 2
      "cpi       %0,     1"   "\n\t"    // is it another invalid port?                             1 clock if first check passed
      "breq    _pTDPZ_INV "   "\n\t"     // otherwise to our handler!                             Only if first check passed, 1 clock 2 if invalid
      "cpi       %0,     4"   "\n\t"    // is it another invalid port?                             1 clock if second check passed
      "brneq   _pTDPZ_INV "   "\n\t"    // to the handler!                                        Only if first check passed, 1 clock 2 if invalid
      // NOW IT IS 0, 2, or 3 or 5 or 255 (NOT_A_PIN) and in the latter case we've jumped past here.
      "add      %0,     %0"   "\n\t"    // << 1                                                   1 clock if valid
      "add      %0,     %0"   "\n\t"    // << 1 so now we have our desired 0, 8, 12, or 20!!      1 clock if valid
      "_pTDPZ_END:"           "\n\t"    // land here from jump to end
    :"+d" (uint8_t)(port)::);                                                            // Total: 9 clocks if valid, 6 if first check failed, 9 if second check faled,  12 if third check failed.
    // plus 10 instruction words.
    // We shall see how this compares to compiler output, I don't think the compiler will beat that!
    return port;
  }
*/
#else
/*
  uint8_t _portToDigitalPinZero(port);
  // Otherwise, we use the garden variety C version. We'll see which is faster and smaller.
  uint8_t _portToDigitalPinZero(port) {
    //always do it this way if we can do it at compile time
    if ((port) > 5 || port == 1 || port == 4) {
      return NOT_A_PIN;
    } else {
      if (port == 0) {
        return 0;
      } elif (port ==2) {
      return 8;
      } elif (port == 3) {
        return 12;
      } else {
        return 20;
      }
    }
    return NOT_A_PIN;
  }
*/
#endif
/*
inline uint8_t portToDigitalPinZero(uint8_t port)    (
  // Inline it so if it can be crunched down to a compil time constat, it is and we do no math on the spot.
  //always do it this way if we can do it at compile time
  if __builtin_constant_p(port) {
    if ((port) > 5 || port == 1 || port == 4) {
      return NOT_A_PIN;
    } else {
      if (port == 0) {
        return 0;
      } elif (port ==2) {
      return 8;
      } elif (port == 3) {
        return 12;
      } else {
        return 20;
      }
    }
    return NOT_A_PIN;
  } else { // otherwise call one of these functions
    #if !defined(ASM_PORT_TO_PIN_ZERO)
      return _portToDigitalPinZero(port);
    #else
      return _portToDigitalPinZero_ASM(port);
    #endif
  }

*/
// PWM pins
#if defined(MILLIS_USE_TIMERB0)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PA3) || ((p) == PIN_PC0))
#elif defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PA2) || ((p) == PIN_PC0))
#elif defined(MILLIS_USE_TIMERB2)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PA2) || ((p) == PIN_PA3))
#else //no TCB's are used for millis
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PA2) || ((p) == PIN_PA3) || ((p) == PIN_PC0))
#endif

// Timer pin mapping
#define TCA0_PINS (PORTMUX_TCA0_PORTD_gc)     // TCA0 output on PD[0:5]
#define TCB0_PINS (0x01)                      // TCB0 output on PF4 (alt)
#define TCB1_PINS (0x02)                      // TCB1 output on PF5 (alt) - Pins on PORTA are more useful than the ones on PORTF
#define TCB2_PINS (0x00)                      // TCB2 output on PC0 (default) as the other options are not present on these parts.
#define TCD0_PINS (PORTMUX_TCD0_PORTF)        // TCD0 output on PF0-3. Same as PORTMUX_TCD0_ALT2_gc. Note that not only is this broken on DA/DB parts.
// Even if it worked there, it would never be as good because they have other alternate functions on those pins while the DDs don't.

